<!-- ------------------------------------------------------------------- -->
<!--                                                                     -->
<!--  modpoly.xml         IdRel documentation             Chris Wensley  -->
<!--                                                    & Anne Heyworth  -->
<!--                                                                     -->
<!-- ------------------------------------------------------------------- -->

<?xml version="1.0" encoding="UTF-8"?>

<Chapter Label="chap-modpoly">
<Heading>Module Polynomials</Heading>

In this chapter we consider finitely generated modules over the 
monoid rings considered previously. 
We call an element of this module a <E>module polynomial</E>,
and we describe functions to construct module polynomials 
and the standard algebraic operations for such polynomials. 
<P/>
A module polynomial <C>modpoly</C> is recorded as a list of pairs, 
<C>[ gen, monpoly ]</C>, 
where <C>gen</C> is a module generator (basis element), 
and <C>monpoly</C> is a monoid polynomial. 
The module polynomial is printed as the formal sum 
of monoid polynomial multiples of the generators. 
Note that the monoid polynomials are the coefficients 
of the module polynomials and appear to the right of the generator, 
as we choose to work with right modules.
<P/>
The examples we are aiming for are the identities among the relators
of a finitely presented group (see section <B>5.4</B>).


<Section><Heading>Construction of module polynomials</Heading>

<ManSection>
   <Oper Name="ModulePoly"
         Arg="gens, monpolys" Label="with input gens, polys" />
   <Oper Name="ModulePoly"
         Arg="args" Label="with input [gen,poly] list" />
   <Oper Name="ZeroModulePoly"
         Arg="Fgens, Fmon" />
<Description>
The function <C>ModulePoly</C> returns a module polynomial. 
The terms of the polynomial may be input as a list of generators 
followed by a list of monoid polynomials or as one list of 
<C>[generator, monoid polynomial]</C> pairs.
<P/>
Assuming that <C>Fgens</C> is the free group on the module generators 
and <C>Fmon</C> is the free group on the monoid generators, 
the function <C>ZeroModulePoly</C> returns the zero module polynomial, 
which has no terms, and is an element of the module.
<P/>
</Description>
</ManSection>
<Example>
<![CDATA[
gap> frq8 := FreeRelatorGroup( q8 );; 
gap> genfrq8 := GeneratorsOfGroup( frq8 ); 
[ q8_R1, q8_R2, q8_R3, q8_R4 ]
gap> Print( rmp1, "\n" );      ## defined in section 4.4.1 
 - 7*q8_M4 + 5*q8_M1 + 9*<identity ...>
gap> mp2 := MonoidPolyFromCoeffsWords( [4,-5], [ M[4], M[1] ] );;
gap> Print( mp2, "\n" ); 
4*q8_M4 - 5*q8_M1
gap> s1 := ModulePoly( [ genfrq8[4], genfrq8[1] ], [ rmp1, mp2 ] );
q8_R1*(4*q8_M4 - 5*q8_M1) + q8_R4*( - 7*q8_M4 + 5*q8_M1 + 9*<identity ...>)
gap> s2 := ModulePoly( [ genfrq8[3], genfrq8[2], genfrq8[1] ], 
>       [ -1*rmp1, 3*mp2, (rmp1+mp2) ] );
q8_R1*( - 3*q8_M4 + 9*<identity ...>) + q8_R2*(12*q8_M4 - 15*q8_M1) + q8_R3*(
7*q8_M4 - 5*q8_M1 - 9*<identity ...>)
gap> zeromp := ZeroModulePoly( frq8, freeq8 );
zero modpoly
]]>
</Example>
</Section>


<Section><Heading>Components of a module polynomial</Heading>

<ManSection>
   <Attr Name="Terms"
         Arg="modpoly" Label="for module polynomials" />
   <Attr Name="LeadTerm"
         Arg="modpoly" Label="for module polynomials" />
   <Attr Name="LeadMonoidPoly"
         Arg="modpoly" />
   <Meth Name="Length"
         Arg="modpoly" Label="for module polynomials" />
   <Attr Name="One"
         Arg="modpoly" />
<Description>
The function <C>Terms</C> returns the terms of a module polynomial 
as a list of pairs.
In <C>LeadTerm</C>, the generators are ordered, 
and the term of <C>modpoly</C> with the highest value generator 
is defined to be the leading term.
The monoid polynomial (coefficient) part of the leading term 
is returned by the function <C>LeadMonoidPoly</C>.
<P/>
The function <C>Length</C> counts the number of module generators 
which occur in <C>modpoly</C> 
(a generator occurs in a polynomial if it has nonzero coefficient).
The function <C>One</C> returns the identity in 
the free group on the generators.
<P/>
</Description>
</ManSection>
<Example>
<![CDATA[
gap> [ Length(s1), Length(s2) ];
[ 2, 3 ]
gap> One( s1 );
<identity ...> 
gap> Terms( s1 );
[ [ q8_R1, 4*q8_M4 - 5*q8_M1 ], 
  [ q8_R4,  - 7*q8_M4 + 5*q8_M1 + 9*<identity ...> ] ]
gap> Print( LeadTerm( s1 ), "\n" );
[ q8_R4,  - 7*q8_M4 + 5*q8_M1 + 9*<identity ...> ]
gap> Print( LeadTerm( s2 ), "\n" );
[ q8_R3, 7*q8_M4 - 5*q8_M1 - 9*<identity ...> ]
gap> Print( LeadMonoidPoly( s1 ), "\n" );
 - 7*q8_M4 + 5*q8_M1 + 9*<identity ...>
gap> Print( LeadMonoidPoly( s2 ), "\n" );
7*q8_M4 - 5*q8_M1 - 9*<identity ...>
]]>
</Example>
</Section>


<Section><Heading>Module Polynomial Operations</Heading>

<Index>=,+,* for module polynomials</Index>

<ManSection>
   <Oper Name="AddTermModulePoly"
         Arg="modpoly, gen, monpoly" />
<Description>
The function <C>AddTermModulePoly</C> adds a term <C>[gen, monpoly]</C> 
to a module polynomial <C>modpoly</C>.
<P/>
Tests for equality and arithmetic operations are performed in the usual way.
Module polynomials may be added or subtracted. 
A module polynomial can also be multiplied on the right by a word 
or by a scalar. 
The effect of this is to multiply the monoid polynomial parts of each term 
by the word or scalar. 
This is made clearer in the example.
<P/>
</Description>
</ManSection>
<Example>
<![CDATA[
gap> mp0 := MonoidPolyFromCoeffsWords( [6], [ M[2] ] );;
gap> Print( mp0, "\n" );
6*q8_M2
gap> s0 := AddTermModulePoly( s1, genfrq8[3], mp0 ); 
q8_R1*(4*q8_M4 - 5*q8_M1) + q8_R3*(6*q8_M2) + q8_R4*( - 7*q8_M4 + 5*q8_M1 +
9*<identity ...>)
gap> Print( s1 + s2, "\n" );
q8_R1*( q8_M4 - 5*q8_M1 + 9*<identity ...>) + q8_R2*(12*q8_M4 -
15*q8_M1) + q8_R3*(7*q8_M4 - 5*q8_M1 - 9*<identity ...>) + q8_R4*( -
7*q8_M4 + 5*q8_M1 + 9*<identity ...>)
gap> Print( s1 - s0, "\n" );
q8_R3*( - 6*q8_M2)
gap> Print( s1 * 1/2, "\n" );
q8_R1*(2*q8_M4 - 5/2*q8_M1) + q8_R4*( - 7/2*q8_M4 + 5/2*q8_M1 + 9/
2*<identity ...>)
gap> Print( s1 * M[1], "\n" );
q8_R1*(4*q8_M4*q8_M1 - 5*q8_M1^2) + q8_R4*( - 7*q8_M4*q8_M1 + 5*q8_M1^2 +
9*q8_M1)
]]>
</Example>
</Section>

</Chapter>
